app/Controllers/Employee.php

    public function index(){
      $model = new EmployeeModel();
      $data['employees'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `employees`
ORDER BY `id` DESC