app/Controllers/Users.php

    public function index()
    {
        $model = new UserModel();

        $data['users'] = $model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `users`
ORDER BY `id` DESC

    public function store()
    {

        helper(['form', 'url']);

        $model = new UserModel();

        $data = [

            'name' => $this->request->getVar('name'),
            'email'  => $this->request->getVar('email'),
            ];

        $save = $model->insert($data);
---
INSERT INTO `users` (`name`, `email`) VALUES ('kamal', 'kamkan@gmail.com')

    public function edit($id = null)
    {

        $model = new UserModel();
        $data['user'] = $model->where('id', $id)->first();
---
SELECT *
FROM `users`
WHERE `id` = '3'
 LIMIT 1

    public function delete($id = null)
    {

     $model = new UserModel();

     $data['user'] = $model->where('id', $id)->delete();
---
DELETE FROM `users`
WHERE `id` = '1'